import {
  View,
  Text,
  TouchableOpacity,
  ScrollView,
  Modal,
} from "react-native";
import { SafeAreaView } from "react-native-safe-area-context";
import React from "react";
import colors from "../../assets/Theme/colors";
import SimpleIcons from "../icons/SimpleIcons";

const TermsAndPolicy = ({
  setoverlayShow,
  handleCheckboxToggle,
  isChecked,
  overlayShow,
  setChecked,
  includeCheckbox,
}) => {
  return (
    <>
      {/* Terms */}
      <View style={{ flexDirection: "row", alignItems: "center" }}>
        {includeCheckbox && (
          <TouchableOpacity onPress={handleCheckboxToggle}>
            {isChecked ? (
              <SimpleIcons
                name="checkbox"
                size={28}
                color={colors.Second[500]}
              />
            ) : (
              <SimpleIcons
                name="checkbox-outline"
                size={28}
                color={colors.Main[600]}
              />
            )}
          </TouchableOpacity>
        )}

        <Text
          style={{ marginLeft: 8, color: "#fff" }}
          onPress={() => {
            setoverlayShow(true);
          }}
        >
          Έχω διαβάσει και αποδέχομαι τους Όρους και την Πολιτική Απορρήτου.
        </Text>
      </View>

      {/* Terms & Policy modal */}
      <Modal
        visible={overlayShow}
        animationType="slide"
        presentationStyle="pageSheet"
        onRequestClose={() => setoverlayShow(false)}
      >
        <SafeAreaView style={{ backgroundColor: "#ffffff", flex: 1 }}>
          <ScrollView style={{ padding: 20 }}>
            {/* Terms of Use */}
            <View>
              <Text style={{ marginBottom: 2, marginTop: 10, fontSize: 20 }}>
                Όροι Χρήσης (Terms of Use)
              </Text>

              <Text style={{ marginTop: 10 }}>
                Καλώς ήρθατε στην εφαρμογή μας Agrowise, για την ενημέρωση των
                αγροτών. Παρακαλούμε διαβάστε προσεκτικά τους παρακάτω όρους
                χρήσης πριν χρησιμοποιήσετε την εφαρμογή μας. Η χρήση της
                εφαρμογής υποδηλώνει αποδοχή και συμφωνία με αυτούς τους όρους.
              </Text>

              <Text style={{ marginTop: 10 }}>
                Αποδοχή Υπευθυνότητας: Η εφαρμογή παρέχει πληροφορίες για τον
                αγροτικό τομέα με βάση την καλύτερη δυνατή γνώση μας. Ωστόσο,
                δεν φέρουμε καμία ευθύνη για την ακρίβεια, την εγκυρότητα ή την
                πληρότητα των πληροφοριών που παρέχονται.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Πνευματικά Δικαιώματα: Το περιεχόμενο που παρέχεται μέσω της
                εφαρμογής (άρθρα, εικόνες, κλπ.) προστατεύεται από πνευματικά
                δικαιώματα. Απαγορεύεται η αντιγραφή, η αναδημοσίευση ή η
                διανομή του περιεχομένου χωρίς την έγγραφη άδεια μας.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Προσωπικός Λογαριασμός: Κατά τη δημιουργία ενός προσωπικού
                λογαριασμού, είστε υπεύθυνοι για την ακεραιότητα και την
                εμπιστευτικότητα των παρεχόμενων πληροφοριών. Πρέπει να
                διατηρείτε τα διαπιστευτήριά σας ασφαλή και να μην τα
                κοινοποιείτε σε τρίτους.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Συμπεριφορά Χρήστη: Κατά τη χρήση της εφαρμογής, αναμένεται να
                τηρείτε τους κανόνες συμπεριφοράς και να μην δημοσιεύετε
                περιεχόμενο που είναι παράνομο, προσβλητικό, προκλητικό ή
                παραβιάζει τα δικαιώματα τρίτων.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Αλληλεπίδραση με τους Διαχειριστές: Η εφαρμογή παρέχει
                δυνατότητα επικοινωνίας με τους διαχειριστές μέσω μηνυμάτων. Οι
                συνομιλίες πρέπει να είναι ευγενικές, εποικοδομητικές και να μην
                παραβιάζουν την ιδιωτικότητα άλλων χρηστών.
              </Text>

              <Text style={{ marginTop: 10 }}>
                Πληροφορίες συνδρομής : Η Agrowise προσφέρει μια συνδρομητική
                υπηρεσία για πρόσβαση στην εφαρμογή. Για να χρησιμοποιήσουν την
                εφαρμογή, οι χρήστες πρέπει να εγγραφούν στον μηνιαίο μας πλάνο,
                το οποίο κοστίζει 0,99 ευρώ ανά μήνα. Η συνδρομή θα ανανεώνεται
                αυτόματα κάθε μήνα εκτός εάν ακυρώνεται τουλάχιστον 24 ώρες πριν
                από το τέλος της τρέχουσας περιόδου συνδρομής. Η πληρωμή θα
                χρεώνεται στο λογαριασμό iTunes (για iOS) και googe Play (για
                συσκευές με υπηρεσίες Google) σας κατά την επιβεβαίωση της
                αγοράς.
              </Text>

              <Text style={{ marginTop: 10 }}>
                Εάν επιθυμείτε να ακυρώσετε τη συνδρομή σας, μπορείτε να το
                κάνετε αυτό πηγαίνοντας στις Ρυθμίσεις του Λογαριασμού σας μετά
                την αγορά. Παρακαλούμε σημειώστε ότι η ακύρωση της συνδρομής δεν
                παρέχει επιστροφή για οποιαδήποτε μη χρησιμοποιηθείσα περίοδος
                της συνδρομής.
              </Text>
            </View>

            {/* Privacy Policy */}
            <View>
              <Text style={{ marginBottom: 2, marginTop: 30, fontSize: 20 }}>
                Πολιτική Απορρήτου (Privacy Policy)
              </Text>

              <Text style={{ marginTop: 10 }}>
                Σας ευχαριστούμε που χρησιμοποιείτε την εφαρμογή μας Agrowise,
                για την ενημέρωση των αγροτών. Αφοσιωμένοι στη διατήρηση του
                απορρήτου και της ασφάλειας των προσωπικών σας πληροφοριών,
                θέλουμε να σας ενημερώσουμε σχετικά με τον τρόπο με τον οποίο
                συλλέγουμε, χρησιμοποιούμε και προστατεύουμε τα προσωπικά σας
                δεδομένα.
              </Text>

              <Text style={{ marginTop: 10 }}>
                Πληροφορίες συνδρομής : Κατά τη διαδικασία εγγραφής στη
                συνδρομή, συλλέγουμε ορισμένες βασικές πληροφορίες, όπως το
                όνομα, το ηλεκτρονικό ταχυδρομείο και τα στοιχεία πληρωμής, για
                να σας παρέχουμε πρόσβαση στην εφαρμογή και να σας εξασφαλίσουμε
                μια εξατομικευμένη εμπειρία. Οι πληροφορίες σας χρησιμοποιούνται
                αποκλειστικά για την εσωτερική λειτουργία της εφαρμογής μας.
                Σημειώστε ότι οι δημοσιεύσεις που δημιουργείτε και τα σχόλια που
                αφήνετε είναι ορατά για τους άλλους χρήστες της εφαρμογής με
                σκοπό την ανταλλαγή γνώσεων και εμπειριών.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Αυτόματη Ανανέωση : Η συνδρομή σας στην Agrowise είναι
                ρυθμισμένη για αυτόματη ανανέωση, εκτός εάν επιλέξετε να την
                ακυρώσετε. Μπορείτε να διαχειριστείτε τη συνδρομή και τις
                ρυθμίσεις αυτόματης ανανέωσης πηγαίνοντας στις Ρυθμίσεις του
                Λογαριασμού σας μετά την αγορά. Με τη συνέχιση της χρήσης της
                εφαρμογής μετά το τέλος της περιόδου συνδρομής, συμφωνείτε να
                χρεώνεστε αυτόματα για την επόμενη περίοδο συνδρομής.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Συλλογή πληροφοριών: Για να δημιουργήσετε έναν λογαριασμό,
                ζητούμε ορισμένες βασικές πληροφορίες, όπως το όνομα, το
                επώνυμο, το ηλεκτρονικό ταχυδρομείο, το τηλέφωνο και τον κωδικό
                πρόσβασης. Αυτές οι πληροφορίες απαιτούνται για να σας παρέχουμε
                πρόσβαση στην εφαρμογή και να σας εξασφαλίσουμε εξατομικευμένη
                εμπειρία.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Χρήση πληροφοριών: Οι πληροφορίες που παρέχετε κατά τη
                δημιουργία του λογαριασμού σας χρησιμοποιούνται για την
                εσωτερική λειτουργία της εφαρμογής μας. Οι δημοσιεύσεις που
                δημιουργείτε και τα σχόλια που αφήνετε είναι ορατά για τους
                άλλους χρήστες της εφαρμογής με σκοπό την ανταλλαγή γνώσεων και
                εμπειριών. Ωστόσο, δεν θα διαμοιραστούμε τις προσωπικές σας
                πληροφορίες με τρίτους χωρίς τη συγκατάθεσή σας.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Προστασία δεδομένων: Λαμβάνουμε τα κατάλληλα μέτρα ασφαλείας για
                να προστατεύσουμε τα προσωπικά σας δεδομένα από απώλεια,
                κατάχρηση ή μη εξουσιοδοτημένη πρόσβαση. Οι πληροφορίες σας
                αποθηκεύονται σε ασφαλή περιβάλλοντα και προσπαθούμε να
                εφαρμόζουμε τις καλύτερες πρακτικές για την προστασία της
                απορρήτου σας.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Τροποποιήσεις στην Πολιτική Απορρήτου: Μπορεί να επιφέρουμε
                αλλαγές στην Πολιτική Απορρήτου μας στο μέλλον, οπότε σας
                συνιστούμε να την επανεξετάζετε περιοδικά. Ενημερώνουμε την
                ημερομηνία τελευταίας ενημέρωσης στο κάτω μέρος της πολιτικής.
              </Text>
              <Text style={{ marginTop: 10 }}>
                Εάν έχετε οποιεσδήποτε ερωτήσεις ή ανησυχίες σχετικά με την
                πολιτική απορρήτου ή την χρήση των προσωπικών σας δεδομένων,
                μπορείτε να επικοινωνήσετε μαζί μας μέσω των στοιχείων
                επικοινωνίας που παρέχονται στην εφαρμογή.
              </Text>
            </View>

            {/* Buttons */}
            <View
              style={{
                flexDirection: "row",
                justifyContent: "space-between",
                marginTop: 30,
                marginBottom: 50,
              }}
            >
              <TouchableOpacity
                style={{
                  paddingHorizontal: 16,
                  paddingVertical: 8,
                  borderRadius: 4,
                  borderWidth: 1,
                  borderColor: colors.Main[500],
                }}
                onPress={() => setoverlayShow(false)}
              >
                <Text
                  style={{
                    color: colors.Main[500],
                    fontWeight: "500",
                    fontSize: 16,
                  }}
                >
                  Πίσω
                </Text>
              </TouchableOpacity>

              {includeCheckbox && (
                <TouchableOpacity
                  style={{
                    paddingHorizontal: 16,
                    paddingVertical: 8,
                    borderRadius: 4,
                    backgroundColor: colors.Main[500],
                  }}
                  onPress={() => {
                    // Add your function here to handle the acceptance of terms
                    // For example, you could set a state variable to indicate acceptance
                    // and then close the overlay.
                    setChecked(true);
                    setoverlayShow(false);
                  }}
                >
                  <Text
                    style={{
                      color: "#ffffff",
                      fontWeight: "500",
                      fontSize: 16,
                    }}
                  >
                    Αποδέχομαι
                  </Text>
                </TouchableOpacity>
              )}
            </View>
          </ScrollView>
        </SafeAreaView>
      </Modal>
    </>
  );
};

export default TermsAndPolicy;
