import { Grid, Typography } from "@material-ui/core";
import { spacing } from "@mui/system";
import React, { useEffect, useState } from "react";
import { getPolicyApi } from "../../api/SettingsApi";

function CancelSubscription() {
  //1) Data
  const [terms, setterms] = useState("");
  const [policy, setpolicy] = useState("");

  //2) UseEffects
  useEffect(() => {
    //getSettingsFunction();

    return;
  }, []);

  //3) Functions

  return (
    <React.Fragment>
      <Grid container style={{ padding: 15 }}>
        <Grid item xs={12}>
          <Typography> Βοήθεια Ακύρωσης Συνδρομής</Typography>
        </Grid>

        {/* Privacy Policy */}
        <Grid item xs={12} mt={10} style={{ marginTop: 50, marginBottom: 10 }}>
          <Grid container>
            <Grid item xs={12}>
              <Typography
                variant="h6"
                style={{ marginBottom: 2, marginTop: 10 }}
              >
                Πολιτική σχετικά με τις συνδρομές
              </Typography>
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Σας ευχαριστούμε που χρησιμοποιείτε την εφαρμογή μας Agrowise, για
              την ενημέρωση των αγροτών. Αφοσιωμένοι στη διατήρηση του απορρήτου
              και της ασφάλειας των προσωπικών σας πληροφοριών, θέλουμε να σας
              ενημερώσουμε σχετικά με τον τρόπο με τον οποίο συλλέγουμε,
              χρησιμοποιούμε και προστατεύουμε τα προσωπικά σας δεδομένα.
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Πληροφορίες συνδρομής : Κατά τη διαδικασία εγγραφής στη συνδρομή,
              συλλέγουμε ορισμένες βασικές πληροφορίες, όπως το όνομα, το
              ηλεκτρονικό ταχυδρομείο και τα στοιχεία πληρωμής, για να σας
              παρέχουμε πρόσβαση στην εφαρμογή και να σας εξασφαλίσουμε μια
              εξατομικευμένη εμπειρία. Οι πληροφορίες σας χρησιμοποιούνται
              αποκλειστικά για την εσωτερική λειτουργία της εφαρμογής μας.
              Σημειώστε ότι οι δημοσιεύσεις που δημιουργείτε και τα σχόλια που
              αφήνετε είναι ορατά για τους άλλους χρήστες της εφαρμογής με σκοπό
              την ανταλλαγή γνώσεων και εμπειριών.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Αυτόματη Ανανέωση : Η συνδρομή σας στην Agrowise είναι ρυθμισμένη
              για αυτόματη ανανέωση, εκτός εάν επιλέξετε να την ακυρώσετε.
              Μπορείτε να διαχειριστείτε τη συνδρομή και τις ρυθμίσεις αυτόματης
              ανανέωσης πηγαίνοντας στις
              <span> Ρυθμίσεις του Λογαριασμού σας </span> μετά την αγορά. Με τη
              συνέχιση της χρήσης της εφαρμογής μετά το τέλος της περιόδου
              συνδρομής, συμφωνείτε να χρεώνεστε αυτόματα για την επόμενη
              περίοδο συνδρομής.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              <span>Διαδικασία ακύρωσης</span> <br />
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              iOS Συσκευή :
              <br /> 1) Ανοίξτε την εφαρμογή App Store.
              <br />
              2) Κάντε κλικ στο όνομά σας. Εάν δεν μπορείτε να βρείτε το όνομά
              σας, κάντε κλικ στην επιλογή Είσοδος.
              <br /> 3) Κάντε κλικ στις Ρυθμίσεις λογαριασμού.
              <br /> 4) Κάντε κύλιση στις Συνδρομές και, στη συνέχεια, κάντε
              κλικ στην επιλογή Διαχείριση.
              <br /> 5) Δίπλα στη συνδρομή, κάντε κλικ στην Επεξεργασία.
              <br /> 6) Κάντε κλικ στην Ακύρωση συνδρομής.
              <br /> Οι οδηγίες υπάρχουν στην επίσημη σελίδα της apple :
              https://support.apple.com/en-us/HT202039
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Android Συσκευή :
              <br /> 1) Ανοίξτε την εφαρμογή Google Play.
              <br /> 2) Επάνω δεξιά, πατήστε το εικονίδιο του προφίλ.
              <br /> 3 )Πατήστε Πληρωμές και συνδρομές Συνδρομές.
              <br /> 4) Επιλέξτε τη συνδρομή ή το προπληρωμένο πρόγραμμα που
              θέλετε να ακυρώσετε.
              <br /> 5) Πατήστε Ακύρωση συνδρομής.
              <br /> 6) Ακολουθήστε τις οδηγίες
              <br /> Οι οδηγίες υπάρχουν στην επίσημη σελίδα της Google :
              https://support.google.com/googleplay/answer/7018481?hl=en&co=GENIE.Platform%3DAndroid
            </Grid>
          </Grid>
        </Grid>
      </Grid>
    </React.Fragment>
  );
}

export default CancelSubscription;
