import { Grid, Typography } from "@material-ui/core";
import { spacing } from "@mui/system";
import React, { useEffect, useState } from "react";
import { getPolicyApi } from "../../api/SettingsApi";

function PrivacyPolicy() {
  //1) Data
  const [terms, setterms] = useState("");
  const [policy, setpolicy] = useState("");

  //2) UseEffects
  useEffect(() => {
    //getSettingsFunction();

    return;
  }, []);

  //3) Functions
  const getSettingsFunction = async (token) => {
    try {
      const response = await getPolicyApi("apiUrl", 1, token);
      const data = await response.json();
      //console.log("User Info: ", data);

      if (data?.resultCode == 0) {
        let t = data?.response?.data[0];
        let p = data?.response?.data[1];

        setterms(t?.url);
        setpolicy(p?.url);
      }
    } catch (error) {
      console.log("Error :", error);
    }
  };

  return (
    <React.Fragment>
      <Grid container style={{ padding: 15 }}>
        <Grid item xs={12}>
          <Typography>Agrowise - Terms of usage & Privacy Policy</Typography>
        </Grid>

        {/* Terms of Use */}
        <Grid item xs={12}>
          <Grid container>
            <Grid item xs={12}>
              <Typography
                variant="h6"
                style={{ marginBottom: 2, marginTop: 10 }}
              >
                Όροι Χρήσης (Terms of Use)
              </Typography>
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Καλώς ήρθατε στην εφαρμογή μας Agrowise, για την ενημέρωση των
              αγροτών. Παρακαλούμε διαβάστε προσεκτικά τους παρακάτω όρους
              χρήσης πριν χρησιμοποιήσετε την εφαρμογή μας. Η χρήση της
              εφαρμογής υποδηλώνει αποδοχή και συμφωνία με αυτούς τους όρους.
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Αποδοχή Υπευθυνότητας: Η εφαρμογή παρέχει πληροφορίες για τον
              αγροτικό τομέα με βάση την καλύτερη δυνατή γνώση μας. Ωστόσο, δεν
              φέρουμε καμία ευθύνη για την ακρίβεια, την εγκυρότητα ή την
              πληρότητα των πληροφοριών που παρέχονται.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Πνευματικά Δικαιώματα: Το περιεχόμενο που παρέχεται μέσω της
              εφαρμογής (άρθρα, εικόνες, κλπ.) προστατεύεται από πνευματικά
              δικαιώματα. Απαγορεύεται η αντιγραφή, η αναδημοσίευση ή η διανομή
              του περιεχομένου χωρίς την έγγραφη άδεια μας.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Προσωπικός Λογαριασμός: Κατά τη δημιουργία ενός προσωπικού
              λογαριασμού, είστε υπεύθυνοι για την ακεραιότητα και την
              εμπιστευτικότητα των παρεχόμενων πληροφοριών. Πρέπει να διατηρείτε
              τα διαπιστευτήριά σας ασφαλή και να μην τα κοινοποιείτε σε
              τρίτους.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Συμπεριφορά Χρήστη: Κατά τη χρήση της εφαρμογής, αναμένεται να
              τηρείτε τους κανόνες συμπεριφοράς και να μην δημοσιεύετε
              περιεχόμενο που είναι παράνομο, προσβλητικό, προκλητικό ή
              παραβιάζει τα δικαιώματα τρίτων.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Αλληλεπίδραση με τους Διαχειριστές: Η εφαρμογή παρέχει δυνατότητα
              επικοινωνίας με τους διαχειριστές μέσω μηνυμάτων. Οι συνομιλίες
              πρέπει να είναι ευγενικές, εποικοδομητικές και να μην παραβιάζουν
              την ιδιωτικότητα άλλων χρηστών.
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Πληροφορίες συνδρομής : Η Agrowise προσφέρει μια συνδρομητική
              υπηρεσία για πρόσβαση στην εφαρμογή. Για να χρησιμοποιήσουν την
              εφαρμογή, οι χρήστες πρέπει να εγγραφούν στον μηνιαίο μας πλάνο,
              το οποίο κοστίζει 0,99 ευρώ ανά μήνα. Η συνδρομή θα ανανεώνεται
              αυτόματα κάθε μήνα εκτός εάν ακυρώνεται τουλάχιστον 24 ώρες πριν
              από το τέλος της τρέχουσας περιόδου συνδρομής. Η πληρωμή θα
              χρεώνεται στο λογαριασμό iTunes (για iOS) και googe Play (για
              συσκευές με υπηρεσίες Google) σας κατά την επιβεβαίωση της αγοράς.
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Εάν επιθυμείτε να ακυρώσετε τη συνδρομή σας, μπορείτε να το κάνετε
              αυτό πηγαίνοντας στις Ρυθμίσεις του Λογαριασμού σας μετά την
              αγορά. Παρακαλούμε σημειώστε ότι η ακύρωση της συνδρομής δεν
              παρέχει επιστροφή για οποιαδήποτε μη χρησιμοποιηθείσα περίοδος της
              συνδρομής.
            </Grid>
          </Grid>
        </Grid>

        {/* Privacy Policy */}
        <Grid item xs={12} mt={10} style={{ marginTop: 50, marginBottom: 10 }}>
          <Grid container>
            <Grid item xs={12}>
              <Typography
                variant="h6"
                style={{ marginBottom: 2, marginTop: 10 }}
              >
                Πολιτική Απορρήτου (Privacy Policy)
              </Typography>
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Σας ευχαριστούμε που χρησιμοποιείτε την εφαρμογή μας Agrowise, για
              την ενημέρωση των αγροτών. Αφοσιωμένοι στη διατήρηση του απορρήτου
              και της ασφάλειας των προσωπικών σας πληροφοριών, θέλουμε να σας
              ενημερώσουμε σχετικά με τον τρόπο με τον οποίο συλλέγουμε,
              χρησιμοποιούμε και προστατεύουμε τα προσωπικά σας δεδομένα.
            </Grid>

            <Grid item xs={12} style={{ marginTop: 10 }}>
              Πληροφορίες συνδρομής : Κατά τη διαδικασία εγγραφής στη συνδρομή,
              συλλέγουμε ορισμένες βασικές πληροφορίες, όπως το όνομα, το
              ηλεκτρονικό ταχυδρομείο και τα στοιχεία πληρωμής, για να σας
              παρέχουμε πρόσβαση στην εφαρμογή και να σας εξασφαλίσουμε μια
              εξατομικευμένη εμπειρία. Οι πληροφορίες σας χρησιμοποιούνται
              αποκλειστικά για την εσωτερική λειτουργία της εφαρμογής μας.
              Σημειώστε ότι οι δημοσιεύσεις που δημιουργείτε και τα σχόλια που
              αφήνετε είναι ορατά για τους άλλους χρήστες της εφαρμογής με σκοπό
              την ανταλλαγή γνώσεων και εμπειριών.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Αυτόματη Ανανέωση : Η συνδρομή σας στην Agrowise είναι ρυθμισμένη
              για αυτόματη ανανέωση, εκτός εάν επιλέξετε να την ακυρώσετε.
              Μπορείτε να διαχειριστείτε τη συνδρομή και τις ρυθμίσεις αυτόματης
              ανανέωσης πηγαίνοντας στις Ρυθμίσεις του Λογαριασμού σας μετά την
              αγορά. Με τη συνέχιση της χρήσης της εφαρμογής μετά το τέλος της
              περιόδου συνδρομής, συμφωνείτε να χρεώνεστε αυτόματα για την
              επόμενη περίοδο συνδρομής.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Συλλογή πληροφοριών: Για να δημιουργήσετε έναν λογαριασμό, ζητούμε
              ορισμένες βασικές πληροφορίες, όπως το όνομα, το επώνυμο, το
              ηλεκτρονικό ταχυδρομείο, το τηλέφωνο και τον κωδικό πρόσβασης.
              Αυτές οι πληροφορίες απαιτούνται για να σας παρέχουμε πρόσβαση
              στην εφαρμογή και να σας εξασφαλίσουμε εξατομικευμένη εμπειρία.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Χρήση πληροφοριών: Οι πληροφορίες που παρέχετε κατά τη δημιουργία
              του λογαριασμού σας χρησιμοποιούνται για την εσωτερική λειτουργία
              της εφαρμογής μας. Οι δημοσιεύσεις που δημιουργείτε και τα σχόλια
              που αφήνετε είναι ορατά για τους άλλους χρήστες της εφαρμογής με
              σκοπό την ανταλλαγή γνώσεων και εμπειριών. Ωστόσο, δεν θα
              διαμοιραστούμε τις προσωπικές σας πληροφορίες με τρίτους χωρίς τη
              συγκατάθεσή σας.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Προστασία δεδομένων: Λαμβάνουμε τα κατάλληλα μέτρα ασφαλείας για
              να προστατεύσουμε τα προσωπικά σας δεδομένα από απώλεια, κατάχρηση
              ή μη εξουσιοδοτημένη πρόσβαση. Οι πληροφορίες σας αποθηκεύονται σε
              ασφαλή περιβάλλοντα και προσπαθούμε να εφαρμόζουμε τις καλύτερες
              πρακτικές για την προστασία της απορρήτου σας.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Τροποποιήσεις στην Πολιτική Απορρήτου: Μπορεί να επιφέρουμε
              αλλαγές στην Πολιτική Απορρήτου μας στο μέλλον, οπότε σας
              συνιστούμε να την επανεξετάζετε περιοδικά. Ενημερώνουμε την
              ημερομηνία τελευταίας ενημέρωσης στο κάτω μέρος της πολιτικής.
            </Grid>
            <Grid item xs={12} style={{ marginTop: 10 }}>
              Εάν έχετε οποιεσδήποτε ερωτήσεις ή ανησυχίες σχετικά με την
              πολιτική απορρήτου ή την χρήση των προσωπικών σας δεδομένων,
              μπορείτε να επικοινωνήσετε μαζί μας μέσω των στοιχείων
              επικοινωνίας που παρέχονται στην εφαρμογή.
            </Grid>
          </Grid>
        </Grid>
      </Grid>
    </React.Fragment>
  );
}

export default PrivacyPolicy;
